id1110 = ("Детское", "Интелектуальное", "Английский язык")
id1120 = ("Детское", "Интелектуальное", "Логопед")
id1130 = ("Детское", "Интелектуальное", "Подготовка к школе")
id1210 = ("Детское", "Спортивное", "Хореография")
id1310 = ("Детское", "Художественное", "Развитие")
id2110 = ("Подростковое", "Интелектуальное", "Подготовка к школе")
id2120 = ("Подростковое", "Интелектуальное", "Ментальная алгебра")
id2130 = ("Подростковое", "Интелектуальное", "Подготовка к ОГЭ/ЕГЭ/ВПР")
id2140 = ("Подростковое", "Интелектуальное", "Английский язык")
id2150 = ("Подростковое", "Интелектуальное", "Армянский язык")
id2160 = ("Подростковое", "Интелектуальное", "Испанский язык")
id2210 = ("Подростковое", "Спортивное", "Хореография")
id2220 = ("Подростковое", "Спортивное", "Хип-Хоп")
id2230 = ("Подростковое", "Спортивное", "Карате")
id2310 = ("Подростковое", "Художественное", "Рисование")
id2320 = ("Подростковое", "Художественное", "Актерское мастерство")
id2330 = ("Подростковое", "Художественное", "Исскуствоведение")
id2340 = ("Подростковое", "Художественное", "Хореография")
id3110 = ("Взрослое", "Интелектуальное", "Английский язык")
id3120 = ("Взрослое", "Интелектуальное", "Армянский язык")
id3130 = ("Взрослое", "Интелектуальное", "Испанский язык")
id3140 = ("Взрослое", "Интелектуальное", "Французский язык")
id3210 = ("Взрослое", "Спортивное", "Йога")
id3220 = ("Взрослое", "Спортивное", "Фитнес")
id3310 = ("Взрослое", "Художественное", "Ораторское искуство")
id3320 = ("Взрослое", "Художественное", "Актерское мастерство")
id3330 = ("Взрослое", "Художественное", "Рисование")
id3340 = ("Взрослое", "Художественное", "Хореография")

def GenerateCATID(data_dictionary):
    class_type = data_dictionary["class_type"]
    age_group = data_dictionary["age_group"]
    direction = data_dictionary["direction"]

    catid = None
    
    if age_group == "👶Дети (4-7 лет)":
        if direction == "🎓Интеллектуальная":
            if class_type == "🇬🇧Английский язык":
                catid = id1110
            elif class_type == "🔠Логопед":
                catid = id1120
            elif class_type == "📚Подготовка к школе":
                catid = id1130
        elif direction == "🥋Спортивная":
            if class_type == "💃Хореография":
                catid = id1210
        elif direction == "🎨Творческая":
            if class_type == "🧐Развитие":
                catid = id1310
    if age_group == "👱Подростки (7-18 лет)":
        if direction == "🎓Интеллектуальная":
            if class_type == "📚Подготовка к школе":
                catid = id2110
            elif class_type == "🔢Ментальная алгебра":
                catid = id2120
            elif class_type == "📖Подготовка к ОГЭ/ЕГЭ/ВПР":
                catid = id2130
            elif class_type == "🇬🇧Английский язык":
                catid = id2140
            elif class_type == "🇦🇲Армянский язык":
                catid = id2150
            elif class_type == "🇪🇸Испанский язык":
                catid = id2160
        if direction == "🥋Спортивная":
            if class_type == "💃Хореография":
                catid = id2210
            elif class_type == "🔊Хип-Хоп":
                catid = id2220
            elif class_type == "🥋Карате":
                catid = id2230
        if direction == "🎨Творческая":
            if class_type == "🎨Рисование":
                catid = id2310
            elif class_type == "🎭Актерское мастерство":
                catid = id2320
            elif class_type == "🖼Исскуствоведение":
                catid = id2330
            elif class_type == "💃Хореография":
                catid = id2340
    if age_group == "🧔‍♂️Взрослые (18-81 лет)":
        if direction == "🎓Интеллектуальная":
            if class_type == "🇬🇧Английский язык":
                catid = id3110
            elif class_type == "🇦🇲Армянский язык":
                catid = id3120
            elif class_type == "🇪🇸Испанский язык":
                catid = id3130
            elif class_type == "🇫🇷Французский язык":
                catid = id3140
        if direction == "🥋Спортивная":
            if class_type == "🧘Йога":
                catid = id3210
            elif class_type == "💪Фитнес":
                catid = id3220
        if direction == "🎨Творческая":
            if class_type == "🎤Ораторское искуство":
                catid = id3310
            elif class_type == "🎭Актерское мастерство":
                catid = id3320
            elif class_type == "🖼Рисование":
                catid = id3330
            elif class_type == "💃Хореография":
                catid = id3340

    return catid